Autodesk.Revit.DB.PrintParameters.OriginOffsetY
The User defined Y value of offset from left bottom corner. Unit is feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if PaperPlacement is not Margins and MarginType is not User defined type.

Autodesk.Revit.DB.PrintParameters.OriginOffsetX
The User defined X value of offset from left bottom corner. Unit is feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if PaperPlacement is not Margins and MarginType is not User defined type.

Autodesk.Revit.DB.PrintParameters.UserDefinedMarginY
The User defined Y value of offset from left bottom corner. Unit is inch.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if PaperPlacement is not Margins and MarginType is not User defined type.

Autodesk.Revit.DB.PrintParameters.UserDefinedMarginX
The User defined X value of offset from left bottom corner. Unit is inch.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if PaperPlacement is not Margins and MarginType is not User defined type.